In [71]:
import rasterio as rs
import geopandas as gpd

In [119]:
def read_tiff(fl):
    # get year
    wy = int(fl.split('wy')[-1].split('_')[0])
    var = fl.split('/')[-1].split('_')[0]
    basin = fl.split('_')[-1].split('.')[0]
    
    with rs.open(fl) as ds: # open the raster
        dat = np.array(ds.read(1))
        nd = ds.nodata
    
    dat[dat==nd] = np.NaN # deal with no data values
    
    metric = np.nanmean(dat) # apply the function to the data file
    
    return wy,basin,var,metric

In [120]:
df = pd.DataFrame()
df['file'] = glob.glob('./data/snodas_cropped/*.tiff')
out = df.file.apply(read_tiff)
wy,basin,var,metric = zip(*out)
dat = pd.DataFrame()
dat['wateryear'] = wy
dat['name'] = basin
dat['variable'] = var
dat['value'] = metric

/home/tbarnhart/miniconda3/envs/py36/lib/python3.6/site-packages/ipykernel_launcher.py:13: RuntimeWarning: Mean of empty slice
  del sys.path[0]

In [117]:
dat.head()

   wateryear      name variable  value
0       2004  10359100   DOWYNS    NaN
1       2004  10366000   DOWYNS  151.0
2       2004  10370000   DOWYNS  161.0
3       2004  10371500   DOWYNS  160.0
4       2004  10378500   DOWYNS  157.0

In [118]:
dat.tail()

      wateryear      name variable  value
1880       2016  14078000   DOWYNS  151.0
1881       2016  14078500   DOWYNS  151.0
1882       2016  14080250   DOWYNS  151.0
1883       2016  14083000   DOWYNS  151.0
1884       2016  14091500   DOWYNS  156.0

In [121]:
dat.to_csv('./data/NVASA_mean.csv',index=False,index_label=False)